MinhTuanEE76/Vehicle/ST_LINK/ExternalLoader/N25Q512A_STM32F769I-EVAL/Src/Loader_Src.c
/**
  ******************************************************************************
  * @file    Loader_Src.c
  * @author  MCD Tools Team
  * @date    October-2015
  * @brief   This file defines the operations of the external loader for
  *          N25Q256A QSPI memory of STM32L476G-EVAL.
  ******************************************************************************
  */

#include "Loader_Src.h"
#include "stm32f769i_eval_qspi.h"
#include <string.h>


/* Private variables ---------------------------------------------------------*/
//QSPI structure
extern QSPI_HandleTypeDef QSPIHandle; 
QSPI_CommandTypeDef sCommand;
QSPI_AutoPollingTypeDef sConfig;



/**
  * @brief  System initialization.
  * @param  None
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */
int Init (uint8_t configureMemoryMappedMode)
{
   SystemInit();
  SystemClock_Config();
  
  /* Zero Init structs */
  memset(&QSPIHandle, 0, sizeof(QSPIHandle));
  memset(&sCommand, 0, sizeof(sCommand));
  memset(&sConfig, 0, sizeof(sConfig));
 
  /* Initialize QuadSPI ------------------------------------------------------ */
  QSPIHandle.Instance = QUADSPI;	  
  HAL_QSPI_DeInit(&QSPIHandle) ;
  
  QSPIHandle.Init.ClockPrescaler     = 2;
  QSPIHandle.Init.FifoThreshold      = 1;
  QSPIHandle.Init.SampleShifting     = QSPI_SAMPLE_SHIFTING_NONE; 
  QSPIHandle.Init.FlashSize          = QSPI_FLASH_SIZE;
  QSPIHandle.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_3_CYCLE; 
  QSPIHandle.Init.ClockMode          = QSPI_CLOCK_MODE_0;
  QSPIHandle.Init.DualFlash          = QSPI_DUALFLASH_DISABLE;
  QSPIHandle.Init.FlashID            = QSPI_FLASH_ID_1;
  
  if (HAL_QSPI_Init(&QSPIHandle) != HAL_OK)
  {
    return 0;
  }
  
  ResetMemory(&QSPIHandle);
  
  /* Enable 32-Bit address mode */
  sCommand.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  sCommand.AddressSize       = QSPI_ADDRESS_32_BITS;
  sCommand.AddressMode       = QSPI_ADDRESS_NONE;
  sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  sCommand.AlternateBytesSize= QSPI_ALTERNATE_BYTES_8_BITS;
  sCommand.DataMode          = QSPI_DATA_NONE;
  sCommand.DdrMode           = QSPI_DDR_MODE_DISABLE;
  sCommand.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  sCommand.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;
  sCommand.DummyCycles       = 0;
  
  sCommand.Instruction       = ENTER_4_BYTE_ADDR_MODE_CMD ;
  QSPIHandle.State           = HAL_QSPI_STATE_READY;
  HAL_QSPI_Command(&QSPIHandle, &sCommand, 0x10); 
  
  /* Configure automatic polling mode to wait the memory is ready */
  if(QSPI_AutoPollingMemReady(&QSPIHandle) != 1)
  {
    return 0;
  }
  if(!configureMemoryMappedMode)
  {
    if(QUADSPI_MappedMode() !=1)
      return 0; //fail
  }
  return 1; 
}




/*******************************************************************************
Description    :	         erase sector in the device										        
Inputs 	:																        
sector address																		
outputs 	:																				
"1" 		: Operation succeeded											
********************************************************************************/
int EraseSector (unsigned long adr) 
{
  if(QSPI_WriteEnable(&QSPIHandle) != 1)
  {
    return 0;
  }
  
  /* Erasing Sequence -------------------------------------------------- */
  sCommand.Instruction       = SECTOR_ERASE_CMD;
  sCommand.AddressMode       = QSPI_ADDRESS_1_LINE;
  sCommand.Address           = adr ;
  sCommand.DataMode          = QSPI_DATA_NONE;
  sCommand.DummyCycles       = 0;

  if(HAL_QSPI_Command( &QSPIHandle, &sCommand,HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  /* Configure automatic polling mode to wait for end of erase ------- */  
  if (QSPI_AutoPollingMemReady(&QSPIHandle) != 1)
  {
    return 0;
  }
  
  return 1 ;	
}

/*******************************************************************************
Description    :	         Erase a full sector in the device 										        
Inputs 	:		 StartSectrorAddress	: Start of sector 														        
EndSectrorAddress	: End of sector 																	
outputs 	:																				
"1" 		: Operation succeeded	
Note : Not Mandatory for SRAM PSRAM and NOR_FLASH
********************************************************************************/
KeepInCompilation int SectorErase (uint32 EraseStartAddress ,uint32 EraseEndAddress)
{      
  uint32 BlockAddr;
  EraseStartAddress = EraseStartAddress - (EraseStartAddress % 0x10000);
  
  while (EraseEndAddress >= EraseStartAddress)
  {      
    BlockAddr = EraseStartAddress & 0x0FFFFFFF;
    if(EraseSector(BlockAddr) != 1)
    {
      return 0;
    }
    EraseStartAddress += 0x10000;
  }
  
  return 1;	
}

/*******************************************************************************
Description :	                Write data to QSPI 														       
Inputs :																					           
Address 	: Write location  										     
Size 		: Length in bytes 										     
buffer 		: Address where to get the data to write	 
outputs :																				           
"1" 	        : Operation succeeded								       
Info :																						           
Note : Mandatory for all types except SRAM and PSRAM			   
********************************************************************************/
KeepInCompilation int Write(uint32 Address, uint32 Size, uint8_t* buffer)
{
  uint32 NumOfPage = 0, NumOfSingle = 0, Addr = 0, count = 0, temp = 0;
  uint32   QSPI_DataNum = 0;
  
  Addr = Address % QSPI_PAGE_SIZE;
  count = QSPI_PAGE_SIZE - Addr;
  NumOfPage =  Size / QSPI_PAGE_SIZE;
  NumOfSingle = Size % QSPI_PAGE_SIZE;
  
  if (Addr == 0) /*!< Address is QSPI_PAGESIZE aligned  */
  {
    if (NumOfPage == 0) /*!< NumByteToWrite < QSPI_PAGESIZE */
    {
      QSPI_DataNum = Size;      
      QSPI_WritePage(Address, QSPI_DataNum, buffer);
    }
    else /*!< Size > QSPI_PAGESIZE */
    {
      while (NumOfPage--)
      {
        QSPI_DataNum = QSPI_PAGE_SIZE;
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
        Address +=  QSPI_PAGE_SIZE;
        buffer += QSPI_PAGE_SIZE;
      }
      
      QSPI_DataNum = NumOfSingle;
      if(QSPI_DataNum > 0)
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
    }
  }
  else /*!< Address is not QSPI_PAGESIZE aligned  */
  {
    if (NumOfPage == 0) /*!< Size < QSPI_PAGESIZE */
    {
      if (NumOfSingle > count) /*!< (Size + Address) > QSPI_PAGESIZE */
      {
        temp = NumOfSingle - count;
        QSPI_DataNum = count;
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
        Address +=  count;
        buffer += count;
        QSPI_DataNum = temp;
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
      }
      else
      {
        QSPI_DataNum = Size; 
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
      }
    }
    else /*!< Size > QSPI_PAGESIZE */
    {
      Size -= count;
      NumOfPage =  Size / QSPI_PAGE_SIZE;
      NumOfSingle = Size % QSPI_PAGE_SIZE;
      QSPI_DataNum = count;
      QSPI_WritePage(Address, QSPI_DataNum, buffer);
      Address +=  count;
      buffer += count;
      
      while (NumOfPage--)
      {
        QSPI_DataNum = QSPI_PAGE_SIZE;
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
        Address +=  QSPI_PAGE_SIZE;
        buffer += QSPI_PAGE_SIZE;
      }
      
