MinhTuanEE76/Vehicle/ST_LINK/ExternalLoader/N25Q512A_STM32F769I-EVAL/Src/Loader_Src.c
      if (NumOfSingle != 0)
      {
        QSPI_DataNum = NumOfSingle;
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
      }
    }
  }
  
  return 1;
}

/*******************************************************************************
Description :		        Write pages to QSPI 														       
Inputs :																					           
Adr	        : Write location  										     
Size 		: Length in bytes 										     
buf 		: Address where to get the data to write	 
outputs :																				           
"1" 	        : Operation succeeded								       			   
********************************************************************************/
int  QSPI_WritePage(unsigned long adr, unsigned long sz, unsigned char *buf) 
{
  if(QSPI_WriteEnable(&QSPIHandle) != 1)
  {
    return 0;
  }
  
  /* Writing Sequence ------------------------------------------------ */
  sCommand.Instruction = QUAD_IN_FAST_PROG_CMD;
  sCommand.AddressMode = QSPI_ADDRESS_1_LINE;
  sCommand.AddressSize = QSPI_ADDRESS_32_BITS;
  sCommand.Address     = adr & 0x0FFFFFFF;
  sCommand.DataMode    = QSPI_DATA_4_LINES;
  sCommand.NbData      = sz;
  
  if (HAL_QSPI_Command(&QSPIHandle, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  if (HAL_QSPI_Transmit(&QSPIHandle, buf, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  /* Configure automatic polling mode to wait for end of program ----- */  
  if(QSPI_AutoPollingMemReady(&QSPIHandle) != 1)
  {
    return 0;
  }
  
  return 1;
}

/*******************************************************************************
Description :			This function send a Write Enable and wait it is effective.														       
Inputs :																					           
hqspi    : QSPI handle										     

outputs :																				           
"1" 	        : Operation succeeded	
********************************************************************************/
static int QSPI_WriteEnable(QSPI_HandleTypeDef *hqspi)
{
  /* Enable write operations ------------------------------------------ */
  sCommand.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  sCommand.Instruction       = WRITE_ENABLE_CMD;
  sCommand.AddressMode       = QSPI_ADDRESS_NONE;
  sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  sCommand.DataMode          = QSPI_DATA_NONE;
  sCommand.DummyCycles       = 0;
  sCommand.DdrMode           = QSPI_DDR_MODE_DISABLE;
  sCommand.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  sCommand.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;
  
  if (HAL_QSPI_Command(&QSPIHandle, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  /* Configure automatic polling mode to wait for write enabling ---- */    
  sConfig.Match           = 0x02;
  sConfig.Mask            = 0x02;
  sConfig.MatchMode       = QSPI_MATCH_MODE_AND;
  sConfig.StatusBytesSize = 1;
  sConfig.Interval        = 0x10;
  sConfig.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;
  
  sCommand.Instruction    = READ_STATUS_REG_CMD;
  sCommand.DataMode       = QSPI_DATA_1_LINE  ;
  
  if (HAL_QSPI_AutoPolling(&QSPIHandle, &sCommand, &sConfig, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  return 1;
}

/*******************************************************************************
Description :		        This function wait for end of operation (erase,write,read).														       
Inputs :																					           
hqspi    : QSPI handle										     

outputs :																				           
NONE
********************************************************************************/
int QSPI_AutoPollingMemReady(QSPI_HandleTypeDef *hqspi)
{
  /* Configure automatic polling mode to wait for memory ready ------ */  
  sCommand.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  sCommand.Instruction       = READ_STATUS_REG_CMD;
  sCommand.AddressMode       = QSPI_ADDRESS_NONE;
  sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  sCommand.DataMode          = QSPI_DATA_1_LINE;
  sCommand.DummyCycles       = 0;
  sCommand.DdrMode           = QSPI_DDR_MODE_DISABLE;
  sCommand.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  sCommand.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;
  
  sConfig.Match           = 0x00;
  sConfig.Mask            = 0x01;
  sConfig.MatchMode       = QSPI_MATCH_MODE_AND;
  sConfig.StatusBytesSize = 1;
  sConfig.Interval        = 0x10;
  sConfig.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;
  
  if (HAL_QSPI_AutoPolling(&QSPIHandle, &sCommand, &sConfig, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  return 1;
}

/*******************************************************************************
Description :			Reset memory.														       
Inputs :																					           
hqspi    : QSPI handle										     

outputs :																				           
None	
********************************************************************************/
void ResetMemory(QSPI_HandleTypeDef *hqspi)
{
  /* Reset memory config, Cmd in 1 line */
  /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2166;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB(); 
  
  /* Send RESET command (0x99) to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2199;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB();
  
  /* Reset memory config, Cmd in 2 lines*/
  /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2266;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB(); 
  
  /* Send RESET command (0x99) to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2299;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB();
  
  /* Reset memory config, Cmd in 4 lines*/
  /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2366;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB(); 
  
  /* Send RESET command (0x99) to reset the memory registers */
  while(QSPIHandle.Instance->SR & QSPI_FLAG_BUSY);  /* Wait for busy flag to be cleared */
  QSPIHandle.Instance->CCR = 0x2399;
  QSPIHandle.Instance->AR = 0;
  QSPIHandle.Instance->ABR = 0;
  QSPIHandle.Instance->DLR = 0;
  __DSB();
}

