MinhTuanEE76/Vehicle/ST_LINK/ExternalLoader/N25Q512A_STM32F769I-EVAL/Src/Loader_Src.c
/*******************************************************************************
Description :                  This function configure the dummy cycle to read.														       
Inputs :																					           
hqspi    : QSPI handle										     

outputs :																				           
"1" 	 : Operation succeeded	
********************************************************************************/
static int QSPI_DummyCyclesCfg(QSPI_HandleTypeDef *hqspi)
{  
  uint8_t reg;  
  
  /* Read Volatile Configuration register --------------------------- */
  sCommand.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  sCommand.Instruction       = READ_VOL_CFG_REG_CMD;
  sCommand.AddressMode       = QSPI_ADDRESS_NONE;
  sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  sCommand.DataMode          = QSPI_DATA_1_LINE;
  sCommand.DummyCycles       = 0;
  sCommand.DdrMode           = QSPI_DDR_MODE_DISABLE;
  sCommand.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  sCommand.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;
  sCommand.NbData            = 1;
  
  if (HAL_QSPI_Command(&QSPIHandle, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  if (HAL_QSPI_Receive(&QSPIHandle, &reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  /* Enable write operations ---------------------------------------- */
  if (!QSPI_WriteEnable(&QSPIHandle))
  {
    return 0;
  }
  
  /* Write Volatile Configuration register (with new dummy cycles) -- */  
  sCommand.Instruction = WRITE_VOL_CFG_REG_CMD;
  MODIFY_REG(reg, 0xF0, (DUMMY_CLOCK_CYCLES_READ_QUAD << POSITION_VAL(0xF0)));
  
  if (HAL_QSPI_Command(&QSPIHandle, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  if (HAL_QSPI_Transmit(&QSPIHandle, &reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 0;
  }
  
  return 1;
}

/*******************************************************************************
Description :			This function configure the memory mapped mode.														       
Inputs :																					           
hqspi    : QSPI handle										     

outputs :																				           
"1" 	 : Operation succeeded	
********************************************************************************/
int QUADSPI_MappedMode(void)
{
  char MemoryMappedMode = 0; 
  
  if (!MemoryMappedMode)	
  {	
    QSPI_MemoryMappedTypeDef sMemMappedCfg;
    
    if( QSPI_DummyCyclesCfg(&QSPIHandle) != 1)
    {
      return 0;
    }
    
    sCommand.InstructionMode    = QSPI_INSTRUCTION_1_LINE;
    sCommand.AddressSize        = QSPI_ADDRESS_WIDTH;
    sCommand.AlternateByteMode  = QSPI_ALTERNATE_BYTES_NONE;
    sCommand.AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS;
    sCommand.DdrMode            = QSPI_DDR_MODE_DISABLE;
    sCommand.DdrHoldHalfCycle   = QSPI_DDR_HHC_ANALOG_DELAY;
    sCommand.SIOOMode           = QSPI_SIOO_INST_EVERY_CMD;
    
    sCommand.Instruction        = QUAD_IN_FAST_PROG_CMD;
    sCommand.AddressMode        = QSPI_ADDRESS_4_LINES;
    sCommand.Address            = 0;
    sCommand.DataMode           = QSPI_DATA_4_LINES;
    sCommand.NbData             = 0; // undefined length until end of memory
    sCommand.Instruction        = QUAD_INOUT_FAST_READ_CMD;
    sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_QUAD;
    
    sMemMappedCfg.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;
    
    if (HAL_QSPI_MemoryMapped(&QSPIHandle, &sCommand, &sMemMappedCfg) != HAL_OK)
    {
      return 0;
    }
    
    MemoryMappedMode = 1;
  }
  
  return 1;
}

/*******************************************************************************
Description :		       Initialisation of ticks counter 														       
Inputs :						     
TickPriority : Set tick priority 
outputs :																				           
NONE
********************************************************************************/
HAL_StatusTypeDef HAL_InitTick(uint32 TickPriority)
{
  return HAL_OK;
}

/*******************************************************************************
Description :		       Delay in mS.														       
Inputs :						     
Delay : Time in mS	
outputs :																				           
NONE
********************************************************************************/
void HAL_Delay(__IO uint32 Delay)
{
  for(int i=0;i<Delay*216000;i++);
}


/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;  
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  RCC_OscInitStruct.PLL.PLLR = 7;
  
  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    while(1) { ; }
  }
  
  /* Activate the OverDrive to reach the 216 MHz Frequency */  
  ret = HAL_PWREx_EnableOverDrive();
  if(ret != HAL_OK)
  {
    while(1) { ; }
  }
  
  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; 
  
